# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'anydesk'
cask 'arc'
cask 'caffeine'
cask 'discord'
#cask 'docker'
cask 'figma'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'github'
cask 'google-chrome'
#cask 'helo'
cask 'herd'
cask 'imageoptim'
cask 'jetbrains-toolbox'
cask 'logi-options-plus'
cask 'phpmon'
cask 'maccy'
cask 'mailpit'
cask 'ray'
cask 'raycast'
#cask 'readdle-spark'
#cask 'screenflow'
cask 'slack'
cask 'telegram'
cask 'the-unarchiver'
cask 'tinkerwell'
#cask 'transmit'
cask 'tunnelbear'
#cask 'tuple'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'whatsapp-beta'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-cascadia-code'
cask 'font-cascadia-mono'
cask 'font-century-gothic'
cask 'font-fira-code'
cask 'font-freeroad'
cask 'font-gilroy'
cask 'font-gobold'
cask 'font-lato'
cask 'font-norwester'
cask 'font-open-sans'
cask 'font-proxima-nova'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'AppIconBuilder', id: 1294179975
mas 'Giphy Capture', id: 668208984
mas 'GoodNotes 5', id: 1444383602
mas 'hidden-bar', id: 1452453066
#mas 'Magnet', id: 441258766
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Speedtest', id: 1153157709
mas 'Xcode', id: 497799835